//
// Created by Asg on 15.06.2025.
//

#include "Block.h"

/*
 * block_texture_id and block_texture_src :
 *
 * 1 - ../Assets/stone_texture.src
 * id - path
 */

int block_texture_id[] = {
	1,
};

const char* block_texture_src[] = {
	"../Assets/stone_texture.src"
};

float vertex[] = {
	// Передняя грань
	-0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
	 0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
	 0.5f,  0.5f,  0.5f,  1.0f, 1.0f,
	-0.5f,  0.5f,  0.5f,  0.0f, 1.0f,

	// Задняя грань
	-0.5f, -0.5f, -0.5f,  1.0f, 0.0f,
	 0.5f, -0.5f, -0.5f,  0.0f, 0.0f,
	 0.5f,  0.5f, -0.5f,  0.0f, 1.0f,
	-0.5f,  0.5f, -0.5f,  1.0f, 1.0f,

	// Левая грань
	-0.5f, -0.5f, -0.5f,  0.0f, 0.0f,
	-0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
	-0.5f,  0.5f,  0.5f,  1.0f, 1.0f,
	-0.5f,  0.5f, -0.5f,  0.0f, 1.0f,

	// Правая грань
	 0.5f, -0.5f, -0.5f,  1.0f, 0.0f,
	 0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
	 0.5f,  0.5f,  0.5f,  0.0f, 1.0f,
	 0.5f,  0.5f, -0.5f,  1.0f, 1.0f,

	// Верхняя грань
	-0.5f,  0.5f,  0.5f,  0.0f, 1.0f,
	 0.5f,  0.5f,  0.5f,  1.0f, 1.0f,
	 0.5f,  0.5f, -0.5f,  1.0f, 0.0f,
	-0.5f,  0.5f, -0.5f,  0.0f, 0.0f,

	// Нижняя грань
	-0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
	 0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
	 0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
	-0.5f, -0.5f, -0.5f,  0.0f, 1.0f

};

unsigned int indices[] = {
	// Передняя грань
	0, 1, 2,
	2, 3, 0,

	// Задняя грань
	4, 5, 6,
	6, 7, 4,

	// Левая грань
	8, 9, 10,
	10, 11, 8,

	// Правая грань
	12, 13, 14,
	14, 15, 12,

	// Верхняя грань
	16, 17, 18,
	18, 19, 16,

	// Нижняя грань
	20, 21, 22,
	22, 23, 20
};


